leobeo-png/Luminas/stm32/try1/Core/Inc/tca9548.h
/*
 * tca9548.h
 *
 *  Created on: Oct 14, 2025
 *  Original Author: Bintang Cahya
 *  https://github.com/Bintang-Cahya/TCA9548A
 */

#ifndef INC_TCA9548_H_
#define INC_TCA9548_H_
#include "stm32f4xx_hal.h"

typedef struct {
    I2C_HandleTypeDef *hi2c;	// I2C HandleTypeDef Pointer
    uint8_t address;			// TCA9548A Address
    uint8_t channels;			// Channel Configuration Data
} TCA9548A_HandleTypeDef;


HAL_StatusTypeDef TCA_Init(TCA9548A_HandleTypeDef *_dev_typedef, I2C_HandleTypeDef *_dev_hi2c, uint8_t _dev_addr);

HAL_StatusTypeDef TCA_OpenChannel(TCA9548A_HandleTypeDef *_dev_typedef, uint8_t _channel);

HAL_StatusTypeDef TCA_CloseChannel(TCA9548A_HandleTypeDef *_dev_typedef, uint8_t _channel);

HAL_StatusTypeDef TCA_SelectChannel(TCA9548A_HandleTypeDef *_dev_typedef, uint8_t _channel);

HAL_StatusTypeDef TCA_SetMultipleChannels(TCA9548A_HandleTypeDef *_dev_typedef, uint8_t _state_data);

HAL_StatusTypeDef TCA_OpenAllChannels(TCA9548A_HandleTypeDef *_dev_typedef);

HAL_StatusTypeDef TCA_CloseAllChannels(TCA9548A_HandleTypeDef *_dev_typedef);

uint8_t TCA_GetChannelStatus(TCA9548A_HandleTypeDef *_dev_typedef, uint8_t _channel);

uint8_t TCA_GetAllChannelStatus(TCA9548A_HandleTypeDef *_dev_typedef);

#endif /* INC_TCA9548_H_ */
